In [ ]:
## PANDAS SERIES

In [68]:
import numpy as np
import pandas as pd

In [69]:
labels=['a','b','c']
my_data=[10,20,30];

In [70]:
arr=np.array(my_data)

In [71]:
d={'a':10,'b':20,'c':30}

In [72]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [73]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [74]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [75]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [76]:
ser1=pd.Series([1,2,3,4],['USA','INDIA','USSR','JAPAN'])

In [77]:
ser1

USA      1
INDIA    2
USSR     3
JAPAN    4
dtype: int64

In [78]:
## PANDAS DATA FRAMES(Indesx Values)

In [79]:
outside=['G1','G1','G1','G2','G2','G2']

In [80]:
inside=[1,2,3,1,2,3]

In [81]:
hier_index=list(zip(outside,inside))

In [82]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [83]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [84]:
df=pd.DataFrame({
                    'col1':[1,2,3,4],
                    'col2':[444,555,666,777],
                    'col3':['abc','def','ghi','xyz']})

In [85]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [86]:
df['col2'].unique()

array([444, 555, 666, 777], dtype=int64)

In [87]:
len(df['col2'].unique())

4

In [88]:
df['col2'].nunique()

4

In [93]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   777  xyz

In [96]:
def times2(x):
    return x*2

In [97]:
times2(3)

6

In [100]:
df['col2'].sum()

2442

In [101]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3    1554
Name: col2, dtype: int64

In [103]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3    1554
Name: col2, dtype: int64

In [104]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [106]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [107]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [108]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [109]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [112]:
data={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]
}

In [113]:
df=pd.DataFrame(data)

In [114]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [115]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [116]:
## DATA INPUT AND OUTPUT

In [117]:
pwd

'D:\\Machine Learning\\ML Practice\\Pandas'

In [122]:
df=pd.read_csv('players_20.csv').head()

In [123]:
df

,sofifa_id,player_url,short_name,long_name,age,dob,height_cm,weight_kg,nationality,club,...,lwb,ldm,cdm,rdm,rwb,lb,lcb,cb,rcb,rb
0,158023,https://sofifa.com/player/158023/lionel-messi/...,L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona,...,68+2,66+2,66+2,66+2,68+2,63+2,52+2,52+2,52+2,63+2
1,20801,https://sofifa.com/player/20801/c-ronaldo-dos-...,Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus,...,65+3,61+3,61+3,61+3,65+3,61+3,53+3,53+3,53+3,61+3
2,190871,https://sofifa.com/player/190871/neymar-da-sil...,Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain,...,66+3,61+3,61+3,61+3,66+3,61+3,46+3,46+3,46+3,61+3
3,200389,https://sofifa.com/player/200389/jan-oblak/20/...,J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,183277,https://sofifa.com/player/183277/eden-hazard/2...,E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid,...,66+3,63+3,63+3,63+3,66+3,61+3,49+3,49+3,49+3,61+3

In [125]:
df.to_csv('My_output',index=False)

In [126]:
pd.read_csv('My_output')

,sofifa_id,player_url,short_name,long_name,age,dob,height_cm,weight_kg,nationality,club,...,lwb,ldm,cdm,rdm,rwb,lb,lcb,cb,rcb,rb
0,158023,https://sofifa.com/player/158023/lionel-messi/...,L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona,...,68+2,66+2,66+2,66+2,68+2,63+2,52+2,52+2,52+2,63+2
1,20801,https://sofifa.com/player/20801/c-ronaldo-dos-...,Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus,...,65+3,61+3,61+3,61+3,65+3,61+3,53+3,53+3,53+3,61+3
2,190871,https://sofifa.com/player/190871/neymar-da-sil...,Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain,...,66+3,61+3,61+3,61+3,66+3,61+3,46+3,46+3,46+3,61+3
3,200389,https://sofifa.com/player/200389/jan-oblak/20/...,J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,183277,https://sofifa.com/player/183277/eden-hazard/2...,E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid,...,66+3,63+3,63+3,63+3,66+3,61+3,49+3,49+3,49+3,61+3

In [128]:
pd.read_excel('Excel_Sample.xlsx').head(2)

   Unnamed: 0  a  b  c  d
0           0  0  1  2  3
1           1  4  5  6  7

In [129]:
type(data)

dict

In [130]:
type(df)

pandas.core.frame.DataFrame